{
  "Changes": [
    {
      "Action": "EditData",
      "Target": "Data/Events/JoshHouse",
      "Entries": {
        "958565/f Steve 1500/t 1200 1500": "playful/13 5/farmer 10 10 0 Steve 11 5 1 Alex 13 5 3/skippable/pause 500/speak Steve \"Alex come on! You know it was an accident.$5\"/pause 500/emote Alex 12/pause 500/speak Alex \"Dude! Look what you did to my weights!$5#$b#And I TOLD you not to touch any of my fitness stuff! I don't touch your bat!$5\"/pause 200/emote Steve 28/pause 500/speak Steve \"Look, man, I'll just buy new ones for you.$9\"/pause 200/speak Alex \"NO! You can't! They were limited edition!$5#$b#I NEEDED them!$5\"/pause 500/emote Steve 28/speak Steve \"Okay, I get they mean a lot to you. I'll just sell something of mine, kay?$5\"/pause 200/speak Alex \"And waste all your money on me? Dude, you're just unbeleivable. Why would I want that?$5\"/pause 200/speak Steve \"I'll just sell my car or something.$5\"/emote farmer 16/pause 1000/speak Alex \"No. Don't sell your damn car. Jesus, if you had never moved here this wouldn't have happened.$5\"/pause 100/warp farmer 10 7 0/pause 100/move farmer 2 0 0/faceDirection Steve 2/faceDirection Alex 2/pause 500/emote farmer 12/pause 200/speak Alex \"@? What are you doing here?$2\"/pause 500/speak Alex \"You heard everything? Good. That means you're on my side. Now tell Steve to clear off.$5\"/pause 200/faceDirection Steve 1/speak Steve \"Excuse me?$5\"/pause 500/speak Alex \"You know what that means.$5\"/question fork1 \"#STOP IT! Don't talk to eachother like that! Alex you're meant to be his friend, and some friend you're acting like. How could you say things like that to him!?#Alex is right. Steve you literally can't follow instructions. I mean, is it really too much to ask for you to leave his stuff alone?\"/fork steveRejection/pause 500/speak Alex \"Unbeleivable. I'm going out.$7\"/pause 500/faceDirection farmer 3/move Alex 0 1 2/pause 100/move Alex -3 0 2/pause 100/move Alex 0 16 2/playSound doorClose/textAboveHead Steve \"God's sake.\"/move farmer 0 -2 1/faceDirection farmer 3/pause 500/emote Steve 28/pause 500/speak Steve \"I've only gone and ruined everything, haven't I?$2\"/pause 500/textAboveHead farmer \"That's not true.\"/pause 500/speak Steve \"He was right, though. If I hadn't have moved here he would still have his stupid limited edition weights...$2#$b#I'm just a screw up.$2\"/question fork1 \"#Friends fight, Steve. Don't worry about it. Alex will calm down, trust me. He doesn't mean it.\"/pause 500/speak Steve \"I...I guess you're right. Thanks for sticking up for me, farmer.$1#$b#I still feel pretty lame, though... I'll make it up to him.$2\"/pause 500/faceDirection Steve 1/speak Steve \"Can we hang out? Just for a little while. I don't think Clint's is open today.$2\"/pause 500/emote farmer 32/pause 1000/globalFade/viewport -1000 -1000/pause 600/stopAnimation farmer/end warpOut",
		"steveRejection": "pause 500/emote Alex 32/speak Alex \"You're right. Steve, clear off.$5\"/pause 200/emote Steve 28/speak Steve \"Fine. But let me know when you stop whining like a baby about your stupid toys.$5\"/speak Alex \"Just leave, man.$5\"/pause 500/faceDirection farmer 3/move Steve -1 0 2/pause 100/move Steve 0 16 2/pause 1000/globalFade/viewport -1000 -1000/end"
      }
    }
  ]
}