{
  "Changes": [
    {
      "Action": "EditData",
      "Target": "Data/Events/Town",
      "Entries": {
        "958564/f Steve 1000/t 800 1300/w sunny": "playful/26 22/farmer 22 27 0 Steve 26 22 2/skippable/move farmer 0 -5 1/speak Steve \"Hey @! Get over here.$3\"/move farmer 3 0 2/faceDirection farmer 2/speak Steve \"Hey. How's your day going?$1\"/faceDirection farmer 1/pause 500/emote farmer 20/speak Steve \"Why are we looking at a fountain? I dunno. It's pretty.#$b#$1\"/pause 500/speak Steve \"And you didn't hear me say that.$5\"/emote farmer 16/speak Steve \"Anyways, change of subject, I heard your farm's really coming on. I don't think I'd be a good farmer.$1\"/faceDirection Steve 2/emote farmer 32/speak Steve \"Haha I'd probably mess it all up. Plant the carrots where the parsnips should be.#$b#And I can see that's a really lame example so anyways$9#$b#Sorry, I tell bad jokes when I'm around pretty people.$4#$b#Eh! That's not what I meant to say- It came out wrong!$7\"/stopAnimation Steve/faceDirection farmer 1/pause 500/faceDirection Steve 3/pause 500/speak Steve \"Oh yeah! I just remembered! Later this afternoon I'm off to play football with Alex. And I was just wondering if you wanted to come along.$3\"/pause 500/speak Steve \"But just to hang out, y'know. I told Alex about you earlier, he said he wants to get to know you.$1\"/pause 500/speak Steve \"And if you wanted, you could stay for lunch. But I'm not pressuring you to do anything, don't worry.$1#$b#Don't think I'm forcing you to come over if you don't want to.$9\"/emote farmer 8/pause 500/speak Steve \"Haha, you're right. I am being stupid.$1\"/pause 500/pause 200/speak Steve \"So what's your family like, @?\"/faceDirection farmer 2/pause 500/speak Steve \"You know, what are your parents like? Did they want you to move here?\"/question fork1 \"#Yeah. I admit I hated my old job. My parents said it paid well, but they knew I couldn't stand it. Life here is much better, and my grandfather used to love life here too.#...\"/fork steveNoResponse/pause 500/faceDirection farmer 1/speak Steve \"Well hey! That's pretty cool. I've heard Lewis tell stories about your grandfather. He was a good man.$1\"/pause 500/faceDirection Steve 3/speak Steve \"And one last thing, just so you know, if your farming life just isn't all it's cracked up to be, or you just wanna hang out with someone.$1\"/pause 500/speak Steve \"Just call me. I'll be here.$1\"/pause 1000/emote farmer 28/speak Steve \"What's wrong?$2#$b#Don't be sad about your grandpa. He'll be watching over you.$1\"/pause 1000/speak Steve \"I would stay and talk more but George wants me to fix the TV. Old man broke it again haha.$3\"/pause 500/faceDirection Steve 3/speak Steve \"See ya around, farmer!$1\"/move Steve 7 0 1 true/faceDirection farmer 1/pause 500/globalFade/viewport -1000 -1000/end",
        "steveNoResponse": "pause500/speak Steve \"Shoot. I didn't mean to pry. Sorry about that.$2\"/pause 500/speak Steve \"Y...yeah I'll uh, see ya later. Sorry again.$2\"/move Steve 2 7 2/pause 500/globalFade/viewport -1000 -1000/end",
		"958566/f Steve 1750/t 2100 2400/w rainy": "rain/52 64/farmer 46 64 1 Steve 55 64 2/skippable/move farmer 8 0 1/pause 500/speak Steve \"You're up late.$9\"/faceDirection farmer 2/speak Steve \"You should head home, y'know. I'm sure you have things to do tomorrow and in this weather it's pretty easy to get sick.$9\"/emote farmer 40/faceDirection farmer 1/pause 500/faceDirection farmer 2/speak Steve \"*sigh* I feel so stupid.$2\"/playMusic echos/pause 4000/speak Steve \"I'm being selfish. I act like a selfish person.$2#$b#And you have no idea what I'm talking about. Might as well start somewhere.$2\"/pause 500/speak Steve \"Can you hear me out?$2\"/faceDirection farmer 1/emote farmer 8/speak Steve \"It's just... I guess I'm homesick.$2#$b#I had the dorkiest, wierdest friends back where I used to live. And I miss them a bunch. And yet, here you come along, and make me laugh harder than I've ever laughed in my life.$2\"/pause 400/speak Steve \"I don't know if I ever told you about my old friends. Or why I left them. I just want you to know that, when I hang around with you, life feels normal again. You actually make me like really, really happy.$2#$b#But I won't get any closer to you, without you knowing why I can't sleep at night.$2#$b#I used to be a jerk. Like, highschool jock jerk kinda guy. Got a girlfriend, who I definitely didn't deserve, and then her friend died. I was pretty horrible to her, but she's done her fair share of bad stuff too, okay? Don't go about this all wrong that I'm some horrible jerk. People died, all around me from there onwards. And this is pretty dark, but I want you to know this.$2#$b#@, when I met you in the museum the other day, I told you I hunted monsters. That was true. And I won't let myself fall for you if that means there's a small chance you could be in danger.$2\"/pause 1000/speak Steve \"But you've also fought monsters, haven't you? You can handle yourself.$2\"/pause 500/speak Steve \"*sigh* -I guess only now I have the confidence to speak my mind to you.$2\"/emote farmer 16/jump farmer/speak Steve \"@, I really like you. I can't stop thinking about you.$4\"/question fork1 \"#I really like you too, Steve. I think we have something here.#I'm sorry... I don't like you like that. Maybe I gave the wrong impression, and I'm sorry for that.\"/fork steveRejection/pause 500/pause 500/speak Steve \"Phew, you don't know how good it feels to hear that, @.$4#$b#I always thought I would never find a soulmate. But here you are.$1\"/emote farmer 60/faceDirection farmer 2 true/stopAnimation Steve/pause 500/speak Steve \"Meeting you was probably one of the best days of my life.$4\"/showFrame Steve 0/faceDirection Steve 3/faceDirection farmer 1/speak Steve \"I can't tell you how good I feel right now.$4\"/emote farmer 32/speak Steve \"Come on, let's get you inside before you get sick.$4\"/globalFade/viewport -1000 -1000/end",
		"steveRejection": "pause 500/emote Steve 28/speak Steve \"I'm sorry. Dammit, I mess everything up.$7\"/pause 500/stopAnimation Steve/showFrame Steve 27/pause 500/speak Steve \"I'm sorry for saying all that, I shouldn't have expected for this to be anything more. I get it. I'll leave you alone from now on.$2\"/move Steve 3 0 1/faceDirection farmer 1/move Steve 0 -1 0/warp Steve 43 65/playSound doorClose/faceDirection farmer 2/emote farmer 40/pause 500/move farmer -15 0 3 true/globalFade/viewport -1000 -1000/end",
		"958569/f Steve 2500/t 1800 2400/w sunny": "playful/61 64/farmer 48 64 1 Steve 61 64 2/skippable/pause 200/move farmer 12 0 2/pause 200/faceDirection Steve 3/pause 50/speak Steve \"@? Oh hey! This is the first time I've seen you all week! It's great to see you again!$1\"/pause 100/emote farmer 20/pause 200/faceDirection farmer 1/speak Steve \"So...how have you been?\"/pause 1000/speak Steve \"Oh god. You can't stop thinking about what I said at the hospital? What did I say?!$7\"/pause 500/emote farmer 40/pause 200/emote farmer 60/pause 200/speak Steve \"I said I was falling in love with you...? Oh wow. Oh jeez. I'm sorry, really. What did you say in return?$7\"/question fork1 \"#I told you that I loved you too.\"/pause 500/pause 500/speak Steve \"Oh...I...I didn't expect that. God, I wish I remembered! Well, yeah, I do like you. Actually, I'm gonna say it. No, I love you.$4\"/question fork1 \"#I love you too, Steve.\"/pause 1000/emote Steve 60/pause 200/speak Steve \"I gotta say...this might just be the best day of my life.$1\"/pause 500/speak Steve \"But before anything else happens, I just want to ask you something...$1\"/pause 400/speak Steve \"@, could you imagine a life together? A life with me? Because it's all good saying we love eachother...$2#$b#But if you can't imagine having a life with me... what's the point?$2#$b#@, I think about you all the time. I can imagine myself living on your farm with you, becoming one-with-nature or whatever.#$b#Can you imagine that?$2\"/pause 1000/emote farmer 40/pause 50/emote farmer 20/speak Steve \"That's great! We could- we could actually have a life together!$1#$b#That is, i-if you want to.$4\"/pause 50/emote farmer 60/speak Steve \"Come on, let's go inside for lunch. Evelyn's got apple pie.\"/pause 200/globalFade/viewport -1000 -1000/end"
      }
    }
  ]
}